testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_100000000____delay-ms_0____loss-rate-percent_0.01____clients-requests_10/3/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 3.73s, 2.68 req/s, 256.05MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305930) total, 130B (130) headers (space savings 86.46%), 953.67MB (1000000000) data
UDP datagram: 49467 sent, 821363 received
                     min         max         mean         sd        +/- sd
time for request:      3.70s       3.72s       3.71s      8.29ms    50.00%
time for connect:     4.06ms     25.40ms     14.62ms      7.18ms    60.00%
time to 1st byte:    25.05ms     28.32ms     26.62ms      1.21ms    60.00%
req/s           :       0.27        0.27        0.27        0.00    80.00%